import React from "react";
import ShowList from "./ShowList";
import { shuffle } from "../utils/utils";

export default function PopularTags(props) {
  const tags = ["小说", "历史", "日本", "外国文学", "文学", "中国", "心理学", "哲学", "经典", "中国文学", "漫画", "随笔", "爱情", "美国", "推理", "社会学", "日本文学", "绘本", "传记", "文化", "成长", "科普", "散文", "英国", "东野圭吾", "悬疑", "青春", "生活", "艺术", "科幻", "社会", "思维", "心理", "旅行", "女性", "言情", "经济学", "人生", "法国", "政治", "管理", "励志", "人性", "村上春树", "好书，值得一读", "经济", "设计", "台湾", "推理小说", "商业", "诗歌", "奇幻", "英国文学", "童话", "美国文学", "金融", "名著", "武侠", "教育", "日本漫画", "儿童文学", "摄影", "政治学", "耽美", "投资", "宗教", "个人管理", "古典文学", "建筑", "治愈", "电影", "人类学", "余华", "计算机", "数学", "中国历史", "互联网", "纪实", "王小波", "科幻小说", "我想读这本书", "网络小说", "東野圭吾", "职场", "韩寒", "三毛", "日系推理", "回忆录", "杂文", "当代文学", "工具书", "亦舒", "温暖", "自我管理", "美食", "德国", "法国文学", "思想", "张爱玲", "阿加莎·克里斯蒂", "散文随笔", "香港", "科学", "政治哲学", "人物传记", "营销", "方法论", "英文原版", "刘慈欣", "编程", "国学", "金庸", "游记", "文化研究", "思想史", "毛姆", "艺术史", "教材", "育儿", "英语"];
  const select = 30;
  const [startIndex, setStartIndex] = React.useState(Math.floor(Math.random() * (tags.length - select)));
  const list = shuffle(tags.slice(startIndex, startIndex + select)).map(k => {
    return { text: k }
  });
  return <ShowList subHeader="热门标签" list={list}></ShowList>
}